#include "base.h"

using namespace std;

void filetovector(const string& filename, vector<string>& words) {
    ifstream file(filename);
    string word;
    while (file >> word) {
        words.push_back(word);
    }
    file.close();
};



int main() {
    setlocale(LC_ALL, "Russian");
    setlocale(LC_ALL, " ");
    string fout("output.txt");
    srand(time(0));


    int n = 0;
    student_data students;

    vector<string> name;
    vector<string> surname;
    vector<string> sec_name;
       
    filetovector("name.txt", name);
    filetovector("surname.txt", surname);
    filetovector("sec_name.txt", sec_name);
    


    printf("Размер базы данных: ");
    scanf("%d", &n);
    printf("\n");

    for (int i = 0; i < n; i++) {
        string gender = " ";
        string rand_name, rand_surname;

        int gender_name = rand() % name.size();
        if (gender_name >= name.size() / 2) {
            int group = (rand() % 6 + 1) * 100 + rand() % 14 + 1;
            double rate = (rand() % (500 - 200 + 1) + 200) / 100.0;
            int day = rand() % 31 + 1;
            int month = rand() % 12 + 1;
            int year = rand() % (2006 - 2000 + 1) + 2000;

            string rand_sec_name = sec_name[(rand()) % (sec_name.size() - 2)];
            string name1 = sec_name[rand() % (sec_name.size()-2)];
            string tmp = sec_name[sec_name.size()-2];
            
            size_t pos = name1.find(tmp);
            if (pos != string::npos) {
                name1.replace(pos, sec_name[sec_name.size()-2].size(), sec_name[sec_name.size()-1]);
            }


            students.add_st("Ж", surname[(rand()) % (surname.size() - 1)] + surname[surname.size() - 1], name[gender_name], name1, group, rate, day, month, year);
        }
        else {
            int group = (rand() % 6 + 1) * 100 + rand() % 14 + 1;
            double rate = (rand() % (500 - 200 + 1) + 200) / 100.0;
            int day = rand() % 31 + 1;
            int month = rand() % 12 + 1;
            int year = rand() % (2006 - 2000 + 1) + 2000;

            students.add_st("М", surname[rand() % (surname.size()-1)], name[gender_name], sec_name[rand() % (sec_name.size()-2)], group, rate, day, month, year);
        }

    }

    //students.filetobase(fout2);

    students.print_base(fout);


    
    

    

    return 0;
}

/*
 vector<string> name_male = {"Иван", "Александр", "Максим", "Артем", "Михаил", "Даниил", "Дмитрий", "Кирилл", "Андрей", "Егор", 
    "Сергей", "Алексей", "Артур", "Ярослав", "Леонид", "Филипп", "Глеб", "Лев", "Денис", "Арсен", "Тимур", "Шамиль", "Владимир",
     "Богдан", "Евгений", "Илья", "Михаил", "Эдвин", "Олег", "Федор", "Ефим", "Юрий", "Ришат"};
    vector<string> surname_male = { "Абдалов", "Алексеенко", "Асхабов", "Балабанов", "Белоусов", "Вагин", "Вдовин", "Верещагин", "Волков",
     "Гридин", "Джураев", "Дроздов", "Емельянов", "Жбанов", "Жумалаев", "Забелин", "Заморев", "Зангиев", "Зарипов", "Ильин", "Кириллов", 
     "Кирюхин", "Киселев", "Козлов", "Конкин", "Костюков", "Круглянский", "Кузиков", "Кузнецов", "Курбанов", "Лемешко", "Лихачев",
      "Малахов", "Мефодьев", "Никонов", "Михайлов", "Панин", "Оганесян", "Пенкин", "Петросян", "Полунин", "Попов", "Прядко", 
      "Рунов", "Рыжов", "Рябчиков", "Самсонов", "Семенов", "Тарасюк", "Татаев", "Федоров", "Фомин", "Хасанов", "Чистоперов", "Эрекайкин"};
    vector<string> sec_name_male = { "Иванович", "Aлександрович", "Максимович", "Артемович", "Михайлович", 
    "Даниилович", "Дмитриевич", "Кириллович", "Андреевич", "Егорович", "Сергеевич", "Алексеевич", "Артурович", "Ярославович",
     "Леонидович", "Филиппович", "Глебович", "Денисович", "Тимурович", "Шамилевич", "Владимирович", "Богданович", "Евгеньевич",
     "Ильич", "Михайлович", "Олегович", "Федорович"};

    vector<string> name_fem = { "Мариям", "Елизавета", "Валерия", "Мария", "Варвара", "Марина", "Анна", "Эвелина", "Анастасия", 
    "Анжелика", "Амира", "Яна", "Светлана", "Екатерина", "Светлана", "Злата", "Ирина", "Виктория", "Альбина", "Алена", 
    "Дарья", "Дана", "Эсмира", "Ольга", "Алина", "Рената", "Лиана", "София", "Ксения", "Кристина", "Илина", "Элеонора", 
    "Юлия", "Лада", "Снежана", "Ева"};

    vector<string> surname_fem = { "Абдалова", "Алексеенко", "Асхабова", "Балабанова", "Белоусова", "Вайнгерт", "Вдовина",
    "Верба", "Волкова", "Гридина", "Гречихина", "Гришина", "Гусева", "Дедова", "Дзюба", "Дубова", "Егорова", "Ермакова", "Ермина",
    "Жук", "Журавлева", "Журова", "Забавина", "Завьялова", "Заева", "Зинин", "Зубова", "Ибрагимова", "Иванова", "Иващенко",
    "Исаева", "Казанцева", "Калиняк", "Карасева", "Касторина", "Киселева", "Ковалева", "Козарь", "Конина", "Лазарева", 
    "Петрухина", "Платова", "Полякова", "Попова", "Разумова", "Ростова", "Савкина", "Сафарян", "Сахарова", "Селезнева",
    "Тарасова", "Тесленко", "Филатова", "Хоменко", "ЦУрикова", "Шерстюкова", "Юлина", "Яковлева"};

    vector<string> sec_name_fem = { "Ивановна", "Александровна", "Максимовна", "Артемовна", "Михайловна", "Данииловна", 
    "Дмитриевна", "Кирилловна", "Андреевна", "Егоровна", "Сергеевна", "Алексеевна", "Артуровна", "Ярославовна", "Леонидовна", 
    "Филипповна", "Глебовна", "Денисовна", "Тимуровна", "Шамилевна", "Владимировна", "Богдановна", "Евгеньевна", 
    "Ильинична", "Михайловна", "Олеговна", "Федоровна",};
    */